tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
cask "adoptopenjdk"
brew "ack"
brew "openssl@1.1"
brew "aircrack-ng"
brew "xz"
brew "python"
brew "azure-cli"
brew "bat"
brew "bmon"
brew "carthage"
brew "clipper", restart_service: true
brew "cmake"
brew "cocoapods"
brew "curl"
brew "exa"
brew "sdl2"
brew "ffmpeg"
brew "gdb"
brew "git"
brew "gnupg"
brew "go"
brew "graphviz"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "iftop"
brew "ipcalc"
brew "john"
brew "jq"
brew "libarchive"
brew "maven"
brew "mitmproxy"
brew "neovim"
brew "ngrep"
brew "nmap"
brew "p0f"
brew "pandoc"
brew "parallel"
brew "perl"
brew "postgresql"
brew "pv"
brew "python@2"
brew "ripgrep"
brew "ruby"
brew "sbt"
brew "scala"
brew "scc"
brew "sd"
brew "sdl2_gfx"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "sk"
brew "speedtest-cli"
brew "telnet"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "wrk"
brew "xsv"
brew "youtube-dl"
brew "zsh"
cask "alacritty"
cask "bartender"
cask "docker"
cask "font-open-sans"
cask "font-roboto"
cask "font-victor-mono"
cask "franz"
cask "gimp"
cask "iina"
cask "inkscape"
cask "osxfuse"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "qutebrowser"
cask "soundflower"
cask "spotify"
cask "suspicious-package"
