brew "stow"
brew "git"
brew "curl"
brew "zsh"
brew "tmux"
brew "neovim"
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "jq"
brew "delta"
brew "starship"
brew "lazygit"
brew "atuin"
brew "glow"
brew "navi"
brew "trash"
brew "jdtls"
brew "gh"
brew "jj"
brew "mise"
brew "devcontainer"
brew "podman"
brew "yazi"
brew "hyperfine"
brew "bandwhich"
brew "ouch"
brew "tokei"
brew "difftastic"
brew "sd"
brew "dust"
brew "duf"
brew "procs"
brew "tealdeer"
brew "xdg-ninja"
cask "alt-tab"
cask "claude-code"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "hiddenbar"
cask "rectangle"
cask "zed"
