brew "stow"
brew "git"
brew "curl"
brew "zsh"
brew "tmux"
brew "neovim"
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "jq"
brew "delta"
brew "starship"
brew "lazygit"
brew "atuin"
brew "glow"
brew "navi"
brew "trash"
brew "jdtls"
brew "gh"
brew "jj"
brew "nvm"
brew "devcontainer"
brew "podman"
brew "sdkman/tap/sdkman-cli"
cask "zed"
cask "alt-tab"
cask "claude-code"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "hiddenbar"
cask "rectangle"
