# ── Core ────────────────────────────────────────────────
brew "stow"              # symlink farm manager
brew "git"               # version control
brew "curl"              # URL data transfer
brew "gh"                # GitHub from the command line
brew "jq"                # JSON processor
brew "age"               # simple file encryption

# ── Shell & prompt ──────────────────────────────────────
brew "fish"              # shell
brew "starship"          # cross-shell prompt
brew "atuin"             # shell history search/sync
brew "navi"              # interactive cheatsheet browser
brew "fzf"               # fuzzy finder
brew "television"        # channel-oriented fuzzy finder
brew "zoxide"            # smarter cd with frecency

# ── Editors & multiplexer ──────────────────────────────
brew "helix"             # modal text editor (Rust)
brew "neovim"            # text editor
brew "tree-sitter-cli"   # parser generator CLI (nvim-treesitter build)
brew "tmux"              # terminal multiplexer
brew "sesh"              # smart tmux session manager

# ── Modern unix replacements ───────────────────────────
brew "eza"               # modern ls replacement
brew "bat"               # cat with syntax highlighting
brew "fd"                # modern find replacement
brew "ripgrep"           # fast recursive grep
brew "xh"                # fast HTTP client (HTTPie-compatible)
brew "hurl"              # HTTP request testing with plain text files
brew "sd"                # intuitive find-and-replace (sed alt)
brew "dust"              # disk usage viewer (du alt)
brew "duf"               # disk free viewer (df alt)
brew "procs"             # modern ps replacement
brew "trash"             # move files to trash instead of rm
brew "ouch"              # compress/decompress archives

# ── Git & VCS tools ────────────────────────────────────
brew "delta"             # syntax-highlighting diff pager
brew "difftastic"        # structural diff tool
brew "lazygit"           # terminal UI for git
brew "jj"                # Jujutsu version control
brew "jjui"              # terminal UI for jj
brew "onefetch"          # git repo summary in terminal

# ── Development ────────────────────────────────────────
brew "mise"              # dev tool version manager
brew "jdtls"             # Java language server
brew "nono"              # capability-based sandbox for AI agents
brew "devcontainer"      # dev container CLI
brew "podman"            # rootless container engine
brew "lazydocker"        # terminal UI for Docker/Podman
brew "fx"                # terminal JSON viewer
brew "scooter"           # interactive find-and-replace TUI

# ── File management & info ─────────────────────────────
brew "yazi"              # terminal file manager
brew "glow"              # terminal markdown renderer
brew "tokei"             # code statistics by language
brew "tealdeer"          # fast tldr client

# ── Diagnostics & benchmarking ─────────────────────────
brew "hyperfine"         # command-line benchmarking
brew "bandwhich"         # per-process bandwidth monitor
brew "xdg-ninja"         # audit XDG base-dir compliance

# ── GUI apps (macOS) ───────────────────────────────────
cask "alacritty"         # GPU-accelerated terminal (OpenGL)
cask "ghostty"           # GPU-accelerated terminal
cask "zed"               # GPU-accelerated code editor
cask "1password"         # password manager
cask "1password-cli"     # 1Password CLI (op)
cask "claude-code"       # Anthropic Claude CLI
cask "alt-tab"           # Windows-style alt-tab switcher
cask "hiddenbar"         # hide menu bar icons
cask "rectangle"         # window snapping via keyboard
cask "font-jetbrains-mono-nerd-font" # patched dev font with icons
