{
  "LuaSnip": {
    "branch": "master"
  },
  "blink.cmp": {
    "branch": "main"
  },
  "catppuccin": {
    "branch": "main"
  },
  "conform.nvim": {
    "branch": "master"
  },
  "diffview.nvim": {
    "branch": "main"
  },
  "flash.nvim": {
    "branch": "main"
  },
  "gitsigns.nvim": {
    "branch": "main"
  },
  "grug-far.nvim": {
    "branch": "main"
  },
  "gruvbox.nvim": {
    "branch": "main"
  },
  "harpoon": {
    "branch": "harpoon2"
  },
  "lazy.nvim": {
    "branch": "main"
  },
  "lazydev.nvim": {
    "branch": "main"
  },
  "lualine.nvim": {
    "branch": "master"
  },
  "mason-lspconfig.nvim": {
    "branch": "main"
  },
  "mason-tool-installer.nvim": {
    "branch": "main"
  },
  "mason.nvim": {
    "branch": "main"
  },
  "neotest": {
    "branch": "master"
  },
  "neotest-java": {
    "branch": "main"
  },
  "nord.nvim": {
    "branch": "master"
  },
  "nvim-autopairs": {
    "branch": "master"
  },
  "nvim-dap": {
    "branch": "master"
  },
  "nvim-dap-ui": {
    "branch": "master"
  },
  "nvim-jdtls": {
    "branch": "master"
  },
  "nvim-lspconfig": {
    "branch": "master"
  },
  "nvim-nio": {
    "branch": "master"
  },
  "nvim-surround": {
    "branch": "main"
  },
  "nvim-tree.lua": {
    "branch": "master"
  },
  "nvim-treesitter": {
    "branch": "main"
  },
  "nvim-treesitter-textobjects": {
    "branch": "main"
  },
  "nvim-web-devicons": {
    "branch": "master"
  },
  "plenary.nvim": {
    "branch": "master"
  },
  "rose-pine": {
    "branch": "main"
  },
  "smart-splits.nvim": {
    "branch": "master"
  },
  "snacks.nvim": {
    "branch": "main"
  },
  "spring-boot.nvim": {
    "branch": "main"
  },
  "tokyonight.nvim": {
    "branch": "main"
  },
  "which-key.nvim": {
    "branch": "main"
  }
}
