tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
cask "adoptopenjdk"
brew "readline"
brew "ack"
brew "openssl@1.1"
brew "pcre"
brew "aircrack-ng"
brew "autoconf"
brew "automake"
brew "gdbm"
brew "xz"
brew "azure-cli"
brew "bat"
brew "bmon"
brew "brew-cask-completion"
brew "broot"
brew "libpng"
brew "gettext"
brew "python"
brew "cairo"
brew "cargo-completion"
brew "carthage"
brew "chruby"
brew "clipper"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "elinks"
brew "exa"
brew "fd"
brew "libevent"
brew "gnutls"
brew "jpeg"
brew "libtiff"
brew "webp"
brew "sdl2"
brew "x264"
brew "xvid"
brew "ffmpeg"
brew "fswatch"
brew "gcc"
brew "gdb"
brew "git"
brew "libgcrypt"
brew "libusb"
brew "gnupg"
brew "go"
brew "graphviz"
brew "lua"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "iftop"
brew "libtool"
brew "imagemagick"
brew "ipcalc"
brew "john"
brew "jq"
brew "lbdb"
brew "libarchive"
brew "pango"
brew "librsvg"
brew "libuv"
brew "libvterm"
brew "llvm"
brew "luarocks"
brew "maven"
brew "mitmproxy"
brew "neovim", args: ["HEAD"]
brew "netcat"
brew "node"
brew "netlify-cli"
brew "ngrep"
brew "nmap"
brew "optipng"
brew "p0f"
brew "pandoc"
brew "parallel"
brew "perl"
brew "pip-completion"
brew "pkg-config"
brew "pngquant"
brew "postgresql"
brew "pstree"
brew "pv"
brew "qemu"
brew "ranger"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "sbt"
brew "scala"
brew "scc"
brew "sd"
brew "sdl2_gfx"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "shellcheck"
brew "shtool"
brew "sk"
brew "speedtest-cli"
brew "telnet"
brew "tmux"
brew "tree"
brew "unar"
brew "vim"
brew "watch"
brew "wget"
brew "wrk"
brew "xsv"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "zsh-completions"
cask "bartender"
cask "font-open-sans"
cask "font-roboto"
cask "font-victor-mono"
cask "inkscape"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
