{
  "LazyVim": {
    "branch": "main"
  },
  "SchemaStore.nvim": {
    "branch": "main"
  },
  "blink.cmp": {
    "branch": "main"
  },
  "bufferline.nvim": {
    "branch": "main"
  },
  "catppuccin": {
    "branch": "main"
  },
  "conform.nvim": {
    "branch": "master"
  },
  "crates.nvim": {
    "branch": "main"
  },
  "diffview.nvim": {
    "branch": "main"
  },
  "dracula.nvim": {
    "branch": "main"
  },
  "everforest-nvim": {
    "branch": "main"
  },
  "flash.nvim": {
    "branch": "main"
  },
  "friendly-snippets": {
    "branch": "main"
  },
  "gitsigns.nvim": {
    "branch": "main"
  },
  "grug-far.nvim": {
    "branch": "main"
  },
  "gruvbox.nvim": {
    "branch": "main"
  },
  "harpoon": {
    "branch": "harpoon2"
  },
  "hunk.nvim": {
    "branch": "master"
  },
  "jj.nvim": {
    "branch": "main"
  },
  "kanagawa.nvim": {
    "branch": "master"
  },
  "lazy.nvim": {
    "branch": "main"
  },
  "lazydev.nvim": {
    "branch": "main"
  },
  "lualine.nvim": {
    "branch": "master"
  },
  "markdown-preview.nvim": {
    "branch": "master"
  },
  "mason-lspconfig.nvim": {
    "branch": "main"
  },
  "mason-nvim-dap.nvim": {
    "branch": "main"
  },
  "mason.nvim": {
    "branch": "main"
  },
  "mini.ai": {
    "branch": "main"
  },
  "mini.hipatterns": {
    "branch": "main"
  },
  "mini.icons": {
    "branch": "main"
  },
  "mini.pairs": {
    "branch": "main"
  },
  "mini.surround": {
    "branch": "main"
  },
  "neo-tree.nvim": {
    "branch": "main"
  },
  "neotest": {
    "branch": "master"
  },
  "noice.nvim": {
    "branch": "main"
  },
  "nord.nvim": {
    "branch": "master"
  },
  "nui.nvim": {
    "branch": "main"
  },
  "nvim-dap": {
    "branch": "master"
  },
  "nvim-dap-ui": {
    "branch": "master"
  },
  "nvim-dap-virtual-text": {
    "branch": "master"
  },
  "nvim-jdtls": {
    "branch": "master"
  },
  "nvim-lint": {
    "branch": "master"
  },
  "nvim-lspconfig": {
    "branch": "master"
  },
  "nvim-nio": {
    "branch": "master"
  },
  "nvim-treesitter": {
    "branch": "main"
  },
  "nvim-treesitter-textobjects": {
    "branch": "main"
  },
  "nvim-ts-autotag": {
    "branch": "main"
  },
  "onedarkpro.nvim": {
    "branch": "main"
  },
  "persistence.nvim": {
    "branch": "main"
  },
  "plenary.nvim": {
    "branch": "master"
  },
  "refactoring.nvim": {
    "branch": "master"
  },
  "render-markdown.nvim": {
    "branch": "main"
  },
  "rose-pine": {
    "branch": "main"
  },
  "rustaceanvim": {
    "branch": "main"
  },
  "smart-splits.nvim": {
    "branch": "master"
  },
  "snacks.nvim": {
    "branch": "main"
  },
  "spring-boot.nvim": {
    "branch": "main"
  },
  "television": {
    "branch": "main"
  },
  "todo-comments.nvim": {
    "branch": "main"
  },
  "tokyonight.nvim": {
    "branch": "main"
  },
  "trouble.nvim": {
    "branch": "main"
  },
  "ts-comments.nvim": {
    "branch": "main"
  },
  "tv.nvim": {
    "branch": "main"
  },
  "vim-illuminate": {
    "branch": "master"
  },
  "which-key.nvim": {
    "branch": "main"
  }
}
